# Два различных натуральных числа n и m называются
# дружественными, если сумма делителей числа n
# (включая 1, но исключая само n) равна числу m и
# наоборот. Например, 220 и 284 – дружественные числа.
# По данному числу k выведите все пары дружественных
# чисел, каждое из которых не превосходит k. Программа
# получает на вход одно натуральное число k, не
# превосходящее 105
# . Программа должна вывести все
# пары дружественных чисел, каждое из которых не
# превосходит k. Пары необходимо выводить по одной в
# строке, разделяя пробелами. Каждая пара должна быть
# выведена только один раз (перестановка чисел новую
# пару не дает).
# Ввод: 
# 300
# Вывод:
# 220 284

k = int(input("Enter K: "))

friendly_dict = dict()

for i in range(2, k):
    count = 1

    for j in range(2, i // 2 + 1):
        if i % j == 0:
            count += j

    friendly_dict[i] = count

print_list = []
for k, v in friendly_dict.items():
    if v in friendly_dict.keys() and k in friendly_dict.values() and friendly_dict[v] == k and friendly_dict[k] == v and k != v and (k,v) not in print_list:
        print(k, v)
    print_list.append((v, k))
